app/controllers/main_controller.rb

  def image
    @picture = Picture.find(params[:id])
---
SELECT * FROM `pictures` WHERE (`pictures`.`id` = 3)