app/controllers/panel_controller.rb

INSERT INTO `pictures` (`created_at`, `image_file_name`, `image_file_size`, `updated_at`, `image_content_type`, `picture_type`, `description`, `image_updated_at`) VALUES('2011-07-02 16:51:39', 'june-11-old_no7__91-nocal-1280x800.jpg', 130504, '2011-07-02 16:51:39', 'image/jpeg', 'wallpaper', 'whisky', '2011-07-02 16:51:38')
---
  def new
    @picture = Picture.create( params[:picture] )